import java.util.Scanner;

/**
 * @author oleg.semen
 * 
 *         Циклічні зсуви Запишемо ціле десяткове число N у двійковій системі і
 *         утворимо всі ліві циклічні зсуви числа N, при яких перша цифра числа
 *         переноситься в кінець числа.
 * 
 *         Наприклад, якщо N=11, в двійковій системі буде 1011, його циклічні
 *         зсуви: 0111, 1110, 1101, 1011. Максимальне значення M з усіх
 *         отриманих у такий спосіб чисел буде мати число 11102 = 1410.
 * 
 *         Для заданого числа N визначити максимальне значення M.
 * 
 *         Технічні умови:
 *         
 *         Вхідні дані
 * 
 *         Єдине число N. 1 ≤ N ≤ 2x10^9.
 * 
 *         Вихідні дані
 * 
 *         Шукане число М.
 * 
 * 
 *         Інформація про задачу 
 *         Ліміт часу: 1 секунда 
 *         Ліміт пам`яті: 64 MB 
 *         Бали за пройдений тест: 10 
 *         Складність: 15% 538/636 
 *         Класифікація: Теорія чисел 
 * 
 *         Приклад 
 *         Приклад вхідних даних   Приклад вихідних даних
 *         11						14
 */

public class eolimp_0027_CycleShift {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);
		int n = in.nextInt();
		in.close();

		String s = Integer.toBinaryString(n);

		for (int i = 1; i < s.length(); ++i) {
			String ss = s.substring(i) + s.substring(0, i);
			int nn = Integer.parseInt(ss, 2);
			if (n < nn) {
				n = nn;
			}
		}

		System.out.println(n);
	}
}
